app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name", "role_id", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
 def create
   @user = User.new(user_params)
   if @user.save

SELECT "tenants".* FROM "tenants"
---
 def superadminhome
   @user=current_user
      @tenants=Tenant.all